[
    {
        "toyId": 1,
        "toyName": "Mega Building Blocks Set",
        "sellerName": "Creative Blocks Co",
        "sellerEmail": "sales@creativeblocks.com",
        "price": 45.99,
        "rating": 4.8,
        "availableQuantity": 65,
        "description": "This comprehensive 500-piece building block set features vibrant colors and unique shapes that inspire endless creativity. Made from high-quality, non-toxic ABS plastic, these blocks are durable and safe for children ages 3+. The set includes special pieces like wheels, windows, doors, and connector blocks that allow young builders to construct everything from simple houses to complex vehicles and imaginative structures. Each block smoothly connects and disconnects, developing fine motor skills and hand-eye coordination. The included idea booklet provides 50+ building suggestions ranging from beginner to advanced projects, ensuring years of engaging play. Perfect for solo construction or collaborative building sessions with friends and family. These blocks are compatible with other major building block brands, allowing for expansion and continued creativity. The storage container with sorting tray makes cleanup easy and teaches organization skills. Watch as your child's spatial awareness, problem-solving abilities, and engineering thinking grow with every creation they build. An excellent educational toy that combines learning with pure fun, encouraging STEM skills through hands-on play.",
        "pictureURL": "https://i.ibb.co/0Q8LZ1x/lego-bricks.jpg",
        "subCategory": "Building Blocks"
    },
    {
        "toyId": 2,
        "toyName": "Advanced RC Stunt Car",
        "sellerName": "Remote Control Masters",
        "sellerEmail": "info@rcmasters.com",
        "price": 59.99,
        "rating": 4.6,
        "availableQuantity": 42,
        "description": "Experience the thrill of high-performance remote control with this advanced stunt car capable of incredible 360-degree flips, spins, and precision driving. Powered by a rechargeable lithium battery that provides 30 minutes of continuous playtime, this RC car features proportional steering for exact control and variable speed settings suitable for beginners and experts alike. The durable polycarbonate body withstands crashes and rough terrain, while the independent suspension system ensures smooth handling on various surfaces. Bright LED headlights and taillights allow for exciting night-time racing adventures. The 2.4GHz radio system prevents interference from other RC vehicles, making it perfect for group play and racing competitions. Includes training mode for younger drivers and expert mode for advanced stunts. The car's waterproof electronics mean puddles and damp grass won't stop the fun. Complete with USB charging cable, extra tires, and detailed instruction manual. This RC car not only provides endless entertainment but also helps develop hand-eye coordination, spatial awareness, and basic understanding of physics and mechanics through interactive play.",
        "pictureURL": "https://i.ibb.co/4T2yJ0T/rc-car.jpg",
        "subCategory": "Remote Control"
    },
    {
        "toyId": 3,
        "toyName": "Deluxe Art Studio Collection",
        "sellerName": "Young Artists Supply",
        "sellerEmail": "support@youngartists.com",
        "price": 38.99,
        "rating": 4.9,
        "availableQuantity": 78,
        "description": "Unleash your child's inner artist with this comprehensive 150-piece art studio collection designed for creative exploration. This complete set includes everything young artists need: 24 vibrant colored pencils, 36 washable markers, 64 crayon colors, 18 watercolor paints, 10 oil pastels, and various brushes. The premium quality art supplies feature smooth application and rich pigmentation for professional-looking results. The organized carrying case with multiple compartments keeps supplies neatly arranged and portable for art sessions anywhere. Included are 50 sheets of premium drawing paper, 10 canvas panels, and 5 art project idea books with step-by-step instructions. All materials are non-toxic, child-safe, and meet ASTM safety standards. The washable markers and paints easily clean from skin and most fabrics, making cleanup stress-free for parents. This art set encourages self-expression, color recognition, fine motor skill development, and creative thinking. Perfect for birthday parties, rainy days, or daily creative time. Watch as your child's confidence grows with each masterpiece they create, developing important artistic skills while having endless fun.",
        "pictureURL": "https://i.ibb.co/4F8n7zK/art-supplies.jpg",
        "subCategory": "Arts & Crafts"
    },
    {
        "toyId": 4,
        "toyName": "Outdoor Adventure Playset",
        "sellerName": "Backyard Fun Company",
        "sellerEmail": "play@backyardfun.com",
        "price": 129.99,
        "rating": 4.7,
        "availableQuantity": 28,
        "description": "Transform your backyard into an exciting adventure playground with this comprehensive outdoor playset designed for active fun and physical development. This sturdy structure features a 6-foot slide with wave design for extra excitement, rock climbing wall with colorful grips, swing set with two belt swings, and a charming playhouse with working door and windows. Constructed from premium cedar wood with weather-resistant treatment, this playset withstands years of outdoor use and various weather conditions. The safety-enhanced design includes rounded corners, smooth surfaces, and secure fasteners to prevent injuries. The sandbox area beneath the playhouse encourages imaginative play and sensory development. Assembly required but comes with detailed instructions and all necessary hardware. Suitable for children ages 3-10 years, supporting up to 400 pounds distributed weight. This playset promotes physical activity, social skills through cooperative play, and imaginative storytelling adventures. The natural wood finish blends beautifully with outdoor environments while providing a safe space for children to develop balance, coordination, and confidence through active play. A perfect centerpiece for family yards that encourages children to enjoy outdoor activities and create lasting childhood memories.",
        "pictureURL": "https://i.ibb.co/0M8Lw2L/balance-bike.jpg",
        "subCategory": "Outdoor Toys"
    },
    {
        "toyId": 5,
        "toyName": "Junior Scientist Lab Kit",
        "sellerName": "Science Explorers Inc",
        "sellerEmail": "lab@scienceexplorers.com",
        "price": 49.99,
        "rating": 4.8,
        "availableQuantity": 35,
        "description": "Ignite a passion for scientific discovery with this comprehensive 50-experiment laboratory kit designed for young scientists ages 8+. This complete STEM learning set includes everything needed to conduct real scientific experiments: test tubes, beakers, measuring equipment, safety goggles, and detailed experiment cards. Children can explore chemistry with safe, non-toxic ingredients to create bubbling reactions, growing crystals, and color-changing solutions. The biology section includes microscope slides and specimen collection tools for exploring the microscopic world. Physics experiments demonstrate principles of magnetism, electricity, and motion through hands-on activities. Each experiment comes with clear, step-by-step instructions and scientific explanations that make complex concepts accessible and fun. The included lab notebook encourages proper scientific method documentation and critical thinking. All materials meet safety standards and are designed specifically for children's use. This kit not only provides hours of educational entertainment but also develops important skills like following instructions, observation, analysis, and problem-solving. Perfect for homeschool science curriculum, supplemental learning, or pure scientific exploration. Watch as your child's curiosity and understanding of the world grows with each exciting experiment they complete.",
        "pictureURL": "https://i.ibb.co/9pK3J5q/science-kit.jpg",
        "subCategory": "Science Kits"
    },
    {
        "toyId": 6,
        "toyName": "Magnetic Construction Blocks",
        "sellerName": "STEM Builders Workshop",
        "sellerEmail": "build@stembuilders.com",
        "price": 69.99,
        "rating": 4.9,
        "availableQuantity": 52,
        "description": "Revolutionize building play with this 120-piece magnetic construction set that combines creativity with STEM learning. These innovative building blocks feature strong, permanently embedded magnets that allow for secure connections and unique architectural possibilities. The set includes squares, triangles, windows, wheels, and special shapes in 8 vibrant colors that inspire endless creative combinations. The magnets rotate 360 degrees, enabling flexible connections and complex structures that defy gravity. Made from high-quality, food-grade ABS plastic that's durable and safe for children ages 3+. The included idea booklet provides building instructions for 30 different models including animals, vehicles, buildings, and abstract sculptures. These blocks develop spatial reasoning, geometry understanding, fine motor skills, and problem-solving abilities through hands-on construction. The storage container with sorting compartments makes organization easy and encourages responsibility. Compatible with other magnetic tile brands for expanded building possibilities. Perfect for individual creative time or collaborative building sessions that teach teamwork and communication skills. An exceptional educational toy that grows with your child, providing years of engaging play while secretly teaching important mathematical and engineering concepts through fun, interactive building experiences.",
        "pictureURL": "https://i.ibb.co/8XqJY5L/magnetic-tiles.jpg",
        "subCategory": "Building Blocks"
    },
    {
        "toyId": 7,
        "toyName": "Professional RC Helicopter",
        "sellerName": "Aero Dynamics Toys",
        "sellerEmail": "fly@aerodynamics.com",
        "price": 79.99,
        "rating": 4.5,
        "availableQuantity": 31,
        "description": "Take to the skies with this professional-grade remote control helicopter featuring advanced flight stability and precise control systems. This 3-channel RC helicopter offers up/down, forward/backward, and left/right movement capabilities with gyro stabilization for smooth, steady flights. The durable metal and ABS construction withstands crashes and rough landings, while the built-in LED navigation lights create spectacular night flying displays. The 2.4GHz spread spectrum technology allows multiple helicopters to fly simultaneously without interference, perfect for family flying sessions or competitions. Features include one-key takeoff/landing, altitude hold function, and speed adjustment settings for beginners and expert pilots. The rechargeable battery provides 15-20 minutes of flight time with only 60 minutes charging time. Includes spare tail rotor, landing skids, and detailed instruction manual with flying tips. This helicopter not only provides thrilling entertainment but also teaches principles of aerodynamics, physics, and hand-eye coordination. The responsive controls help develop fine motor skills and spatial awareness while offering an exciting introduction to the world of aviation and remote control technology.",
        "pictureURL": "https://i.ibb.co/0C8nQ1L/drone-camera.jpg",
        "subCategory": "Remote Control"
    },
    {
        "toyId": 8,
        "toyName": "Pottery Wheel Studio",
        "sellerName": "Creative Hands Studio",
        "sellerEmail": "clay@creativehands.com",
        "price": 55.99,
        "rating": 4.7,
        "availableQuantity": 44,
        "description": "Discover the ancient art of pottery with this complete pottery wheel studio designed for young artists. This electric pottery wheel features variable speed control from 0-220 RPM, allowing children to create everything from simple pinch pots to sophisticated thrown pottery. The included 2 pounds of air-dry clay requires no kiln or baking - creations dry naturally into durable, paintable artwork. The complete set includes 8 pottery tools for shaping, carving, and detailing, 6 paint pots with brush, and 5 project idea cards with step-by-step instructions. The splash guard and easy-clean surface make mess management simple, while the powerful motor ensures smooth, consistent rotation for professional results. This arts and crafts experience develops patience, fine motor skills, and three-dimensional thinking while encouraging creative expression. Children learn about form, texture, and design principles through hands-on creation. The satisfaction of transforming a lump of clay into a beautiful, functional object builds confidence and artistic appreciation. Perfect for rainy day activities, art classes, or developing a lifelong hobby in ceramics. All materials are non-toxic and child-safe, meeting the highest safety standards for creative play and artistic development.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/pottery-wheel.jpg",
        "subCategory": "Arts & Crafts"
    },
    {
        "toyId": 9,
        "toyName": "Trampoline with Safety Enclosure",
        "sellerName": "Jump Active Sports",
        "sellerEmail": "jump@activesports.com",
        "price": 189.99,
        "rating": 4.8,
        "availableQuantity": 22,
        "description": "Bring the joy of bouncing to your backyard with this premium 8-foot trampoline featuring full safety enclosure and weather-resistant construction. Designed for active play and physical development, this trampoline features 48 galvanized steel springs that provide excellent bounce while maintaining stability. The safety net enclosure with padded poles completely surrounds the jumping area, preventing falls and ensuring worry-free play. The UV-resistant jumping mat and weather-proof frame withstand sun exposure and rain, providing years of outdoor fun. The included ladder makes access easy for young children, while the zippered entrance ensures secure containment during use. Assembly required with detailed instructions and all necessary tools included. This trampoline promotes cardiovascular health, balance, coordination, and gross motor skill development through active play. The weight capacity of 220 pounds allows for solo jumping or supervised play with siblings. Perfect for burning off energy, improving fitness, and developing physical confidence in a safe, controlled environment. The joy of bouncing helps reduce stress, improve mood, and encourage an active lifestyle from an early age. An excellent investment in physical health and outdoor entertainment that the whole family can enjoy.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/trampoline.jpg",
        "subCategory": "Outdoor Toys"
    },
    {
        "toyId": 10,
        "toyName": "Chemistry Lab Explorer Set",
        "sellerName": "Young Chemists Club",
        "sellerEmail": "lab@youngchemists.com",
        "price": 42.99,
        "rating": 4.6,
        "availableQuantity": 38,
        "description": "Dive into the fascinating world of chemistry with this comprehensive 30-experiment laboratory set designed specifically for young scientists. This complete chemistry kit includes real laboratory equipment: beakers, test tubes, measuring spoons, safety goggles, and detailed experiment manual. Children can conduct safe, educational experiments that demonstrate chemical reactions, pH testing, crystal growing, and chromatography. The non-toxic chemicals and ingredients are specially formulated for children's use while providing authentic scientific experiences. Each experiment includes clear instructions, scientific explanations, and real-world applications that make learning engaging and relevant. The included lab notebook encourages proper scientific documentation and develops critical thinking skills. This kit introduces fundamental chemistry concepts like acids and bases, chemical reactions, and molecular structures in an accessible, hands-on way. Perfect for homeschool science education, classroom demonstrations, or curious young minds eager to explore the scientific world. Safety features include child-safe materials, clear warning labels, and adult supervision guidelines. Watch as your child's understanding of science grows through direct experimentation and discovery, building a solid foundation for future scientific learning and potentially sparking a lifelong passion for chemistry and scientific exploration.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/chemistry-lab.jpg",
        "subCategory": "Science Kits"
    },
    {
        "toyId": 11,
        "toyName": "Architectural Building Set",
        "sellerName": "Future Engineers Co",
        "sellerEmail": "build@futureengineers.com",
        "price": 52.99,
        "rating": 4.7,
        "availableQuantity": 47,
        "description": "Inspire the next generation of architects and engineers with this sophisticated 280-piece building set focused on structural design and architectural principles. This advanced construction kit features unique connector pieces, beams, panels, and decorative elements that allow children to create complex structures with realistic architectural details. The specialized pieces enable the construction of bridges with proper support systems, multi-story buildings with stable frameworks, and creative structures that demonstrate real engineering concepts. The included project guide introduces architectural terminology and structural principles through 25 building challenges of increasing difficulty. Made from high-quality plastic that securely connects and disassembles easily for rebuilding. This set develops advanced spatial reasoning, understanding of geometry and physics, and problem-solving skills through hands-on engineering challenges. The realistic scale and authentic building techniques provide genuine insight into architectural design and construction methods. Perfect for children who have mastered basic building blocks and are ready for more complex construction challenges. An excellent educational tool that combines creativity with STEM learning, encouraging logical thinking, planning skills, and innovative design solutions. Watch as your child's confidence and understanding of structural engineering grows with each successful construction they complete.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/architecture-set.jpg",
        "subCategory": "Building Blocks"
    },
    {
        "toyId": 12,
        "toyName": "RC Speed Boat",
        "sellerName": "Aqua Racing Toys",
        "sellerEmail": "race@aquaracing.com",
        "price": 44.99,
        "rating": 4.4,
        "availableQuantity": 36,
        "description": "Make a splash with this high-speed remote control boat designed for exciting water adventures in pools, lakes, or calm ponds. This 2.4GHz RC boat features a powerful motor that creates realistic wake and spray effects while reaching impressive speeds. The self-righting hull design automatically flips the boat upright if it capsizes, ensuring continuous play without interruptions. The waterproof electronics and sealed battery compartment allow for worry-free operation in water. The bright color scheme and LED running lights make the boat highly visible during daytime and evening play sessions. Includes rechargeable battery and USB charging cable for convenient power management. The responsive controller provides precise steering control and variable speed settings suitable for beginners and experienced captains alike. This RC boat introduces children to basic principles of buoyancy, propulsion, and hydrodynamics through hands-on play. Perfect for outdoor family fun, pool parties, or developing an interest in marine technology and water sports. The durable ABS construction withstands collisions and regular use, providing long-lasting entertainment. An excellent way to encourage outdoor play and water activities while developing hand-eye coordination and understanding of physical science concepts in an exciting, interactive format.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/rc-boat.jpg",
        "subCategory": "Remote Control"
    },
    {
        "toyId": 13,
        "toyName": "Bead Jewelry Making Kit",
        "sellerName": "Designer Jewelry Studio",
        "sellerEmail": "beads@designerstudio.com",
        "price": 28.99,
        "rating": 4.8,
        "availableQuantity": 89,
        "description": "Unleash creativity and fashion design skills with this comprehensive 2000-piece bead jewelry making kit perfect for young designers. This deluxe set includes an incredible variety of beads: colorful plastic beads, shiny pony beads, alphabet beads for personalized creations, glow-in-the-dark beads, and special charm beads. The complete jewelry-making tools include elastic cord, stretch magic string, clasps, jump rings, and detailed instructions for creating bracelets, necklaces, rings, and keychains. The organized storage case with multiple compartments keeps beads sorted by color and type, making creative sessions efficient and enjoyable. This arts and crafts activity develops fine motor skills, color recognition, pattern creation, and counting skills through hands-on design work. Children learn basic jewelry techniques while expressing their personal style through custom creations. The included project ideas range from simple beginner patterns to advanced designs that challenge growing skills. Perfect for playdates, birthday parties, or quiet creative time that results in wearable art. The sense of accomplishment from creating beautiful jewelry builds confidence and encourages continued artistic exploration. All materials are non-toxic and meet child safety standards, ensuring worry-free creative expression for hours of engaging, productive fun.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/jewelry-kit.jpg",
        "subCategory": "Arts & Crafts"
    },
    {
        "toyId": 14,
        "toyName": "Soccer Goal Set",
        "sellerName": "Champion Sports Gear",
        "sellerEmail": "sports@championgear.com",
        "price": 34.99,
        "rating": 4.5,
        "availableQuantity": 63,
        "description": "Score big with this complete soccer training set designed for backyard fun and skill development. This professional-style soccer goal set features two 4-foot x 3-foot goals with durable fiberglass frames and reinforced netting that withstands powerful shots and outdoor weather conditions. The portable design sets up in minutes without tools and folds flat for easy storage and transport. Includes two soccer balls in different sizes suitable for various age groups and skill levels. The set comes with 10 training cones for dribbling practice, passing drills, and obstacle courses that develop ball control and coordination. Perfect for individual practice, family games, or organized play with friends. This soccer set encourages physical activity, teamwork, and sportsmanship while developing important athletic skills. The adjustable goal size allows for different difficulty levels as skills improve. An excellent way to introduce children to the world's most popular sport while promoting healthy exercise and outdoor play. The high-quality materials ensure years of active use, making this a valuable investment in physical health and sports education. Watch as your child's confidence, coordination, and love for sports grow with each practice session and friendly match in your own backyard.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/soccer-goal.jpg",
        "subCategory": "Outdoor Toys"
    },
    {
        "toyId": 15,
        "toyName": "Electronic Circuit Board",
        "sellerName": "Tech Wizards Lab",
        "sellerEmail": "circuits@techwizards.com",
        "price": 59.99,
        "rating": 4.7,
        "availableQuantity": 41,
        "description": "Explore the fascinating world of electronics with this advanced circuit building kit that teaches real electrical engineering concepts through hands-on experimentation. This comprehensive set includes over 60 electronic components: resistors, capacitors, transistors, LEDs, speakers, and integrated circuits that snap together on the durable plastic base. The color-coded, numbered components and detailed project manual guide children through 300+ electronic projects ranging from simple circuits to complex devices. Create working models of AM radios, doorbells, alarms, electronic games, and automated devices that demonstrate practical applications of electronic principles. The safe spring-based connection system requires no soldering or tools, making electronics accessible to young learners. This STEM-focused kit teaches series and parallel circuits, conductivity, resistance, and semiconductor technology in an engaging, interactive format. The progressive difficulty of projects ensures continuous learning and skill development as children advance from basic to complex electronic creations. Perfect for developing logical thinking, problem-solving skills, and understanding of technology that powers our modern world. An exceptional educational tool that can spark a lifelong interest in electronics, engineering, and innovation while providing hours of challenging, rewarding fun that prepares children for future technological careers.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/circuit-board.jpg",
        "subCategory": "Science Kits"
    },
    {
        "toyId": 16,
        "toyName": "Giant Building Planks",
        "sellerName": "Construction Masters Co",
        "sellerEmail": "build@constructionmasters.com",
        "price": 39.99,
        "rating": 4.9,
        "availableQuantity": 58,
        "description": "Experience the timeless appeal of wooden construction with this 200-piece set of precision-cut building planks that inspire architectural creativity and engineering thinking. These sustainably sourced pine planks are cut to exact specifications with smooth edges and consistent dimensions that enable stable, intricate structures. The natural wood finish showcases the beautiful grain while providing excellent friction for secure stacking. Unlike interlocking blocks, these planks require no connectors or fasteners - they rely on balance, gravity, and creative placement to create stunning structures. Children can build everything from simple towers to complex bridges, castles, and geometric sculptures that demonstrate real architectural and engineering principles. The included idea booklet provides building techniques and challenging projects that develop spatial reasoning, patience, and problem-solving skills. This open-ended building system grows with your child, offering endless possibilities for creative expression and structural experimentation. The durable wood construction ensures years of use and can be passed down through generations. Perfect for developing fine motor skills, understanding of physics and balance, and encouraging persistence through trial and error. An eco-friendly, screen-free toy that promotes concentration, creativity, and cognitive development through the simple, satisfying process of building and creating with natural materials.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/building-planks.jpg",
        "subCategory": "Building Blocks"
    },
    {
        "toyId": 17,
        "toyName": "RC Construction Vehicle",
        "sellerName": "Heavy Equipment Toys",
        "sellerEmail": "construction@heavyeq.com",
        "price": 67.99,
        "rating": 4.6,
        "availableQuantity": 29,
        "description": "Bring construction site excitement home with this realistic remote control excavator featuring fully functional movements and durable construction. This 1:16 scale RC construction vehicle replicates real heavy machinery with working boom arm, bucket, and rotating cab that provides 360-degree operation. The dual-motor system delivers powerful digging action and smooth movement across various terrains. The proportional controls allow precise operation of all functions simultaneously, just like real construction equipment. The robust metal and ABS construction withstands rough play and outdoor use, while the oversized treads provide excellent traction on grass, dirt, and indoor surfaces. The 2.4GHz remote control ensures interference-free operation with a range of up to 50 meters. Includes rechargeable battery and USB charging cable for convenient power management. This RC vehicle not only provides thrilling entertainment but also teaches basic principles of mechanics, hydraulics, and engineering through interactive play. The realistic operation helps children understand how construction equipment works while developing hand-eye coordination and spatial awareness. Perfect for outdoor sandbox play, indoor construction sites, or developing an interest in engineering and heavy machinery. An educational toy that combines fun with learning, encouraging imagination and technical understanding through hands-on operation.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/rc-excavator.jpg",
        "subCategory": "Remote Control"
    },
    {
        "toyId": 18,
        "toyName": "Origami Craft Collection",
        "sellerName": "Paper Art Studio",
        "sellerEmail": "paper@artstudio.com",
        "price": 22.99,
        "rating": 4.4,
        "availableQuantity": 72,
        "description": "Discover the ancient Japanese art of paper folding with this comprehensive origami kit containing everything needed to create beautiful paper sculptures. This complete set includes 200 sheets of premium origami paper in 24 vibrant colors and patterns, specially cut to perfect squares for traditional origami. The detailed instruction book features step-by-step diagrams for 50 different models ranging from simple animals to complex modular origami. Learn to create jumping frogs, flapping birds, blooming flowers, and geometric shapes that demonstrate mathematical principles through art. The included practice paper allows for mistakes and learning without wasting decorative sheets. This arts and crafts activity develops spatial reasoning, fine motor skills, patience, and ability to follow sequential instructions. The progressive difficulty of projects ensures continuous challenge and skill development as folding techniques improve. Origami teaches geometry, fractions, and symmetry in a hands-on, visual way that makes mathematical concepts accessible and enjoyable. The portable carrying case makes this perfect for travel, waiting rooms, or quiet time activities that stimulate the mind and calm the spirit. Watch as your child's concentration, perseverance, and artistic ability grow with each successful paper creation. A screen-free activity that promotes mindfulness, creativity, and cognitive development through the simple, magical transformation of flat paper into three-dimensional art.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/origami-kit.jpg",
        "subCategory": "Arts & Crafts"
    },
    {
        "toyId": 19,
        "toyName": "Water Slide Splash Park",
        "sellerName": "Summer Fun Manufacturing",
        "sellerEmail": "water@summerfun.com",
        "price": 79.99,
        "rating": 4.8,
        "availableQuantity": 34,
        "description": "Create your own backyard water park with this exciting inflatable water slide that provides hours of cooling summer fun. This massive 10-foot water slide features a climbing wall with handholds, splash pool with spray arch, and smooth sliding surface that creates the perfect aquatic adventure. The durable PVC construction with reinforced stitching withstands active play and regular use, while the electric air pump included makes setup quick and easy. The continuous water flow system connects to any standard garden hose, creating a refreshing water experience that helps children stay cool during hot weather. The safety features include inflated side walls, soft landing area, and stable base design that prevents tipping or shifting during use. This water slide encourages physical activity, social interaction, and outdoor play while developing coordination and confidence. Perfect for birthday parties, family gatherings, or daily summer entertainment that gets children away from screens and into active, healthy play. The compact storage design deflates flat for easy winter storage. Watch as your backyard becomes the neighborhood's favorite summer destination, providing endless entertainment and helping create cherished childhood memories of summer fun, laughter, and active water play that promotes physical health and social development.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/waterslide.jpg",
        "subCategory": "Outdoor Toys"
    },
    {
        "toyId": 20,
        "toyName": "Microscope Science Lab",
        "sellerName": "Biology Discovery Co",
        "sellerEmail": "microscope@biologydiscovery.com",
        "price": 74.99,
        "rating": 4.7,
        "availableQuantity": 26,
        "description": "Unlock the hidden world of microscopy with this professional-grade children's microscope featuring 400x magnification and complete laboratory accessories. This real optical microscope includes three magnification levels (100x, 200x, 400x) with precision focusing and built-in LED illumination for clear, detailed viewing. The complete science kit contains 25 prepared slides with fascinating specimens like insect wings, plant cells, and textile fibers, plus blank slides and cover slips for creating custom specimens. The included tools include specimen collection vials, petri dishes, tweezers, and detailed experiment guide with 50+ science activities. Children can explore pond water microorganisms, examine household materials, and discover the cellular structure of plants and animals. This microscope introduces proper scientific methodology, specimen preparation, and detailed observation skills that form the foundation of biological sciences. The durable metal construction with plastic components ensures stability and long-term use, while the battery-powered operation makes it portable for field research. Perfect for homeschool science curriculum, classroom use, or curious young scientists eager to explore the microscopic world. An exceptional educational tool that can spark a lifelong passion for biology, medicine, or scientific research while developing important skills in observation, analysis, and scientific thinking through hands-on discovery of the invisible world around us.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/microscope.jpg",
        "subCategory": "Science Kits"
    },
    {
        "toyId": 21,
        "toyName": "Gear Construction Set",
        "sellerName": "Mechanical Engineers Co",
        "sellerEmail": "gears@mechanicalengineers.com",
        "price": 48.99,
        "rating": 4.6,
        "availableQuantity": 43,
        "description": "Discover the mechanics of motion with this innovative 250-piece gear construction set that teaches fundamental engineering principles through hands-on building. This unique building system features interlocking gears, connectors, and bases that create working mechanical models with moving parts. The color-coded pieces include spur gears, crown gears, worm gears, and gear racks that demonstrate different types of mechanical movement and power transmission. Build 30 different working models including cars with moving wheels, windmills with rotating blades, carnival rides, and complex machines with multiple gear ratios. The included motorized power source brings creations to life with automated movement that demonstrates real mechanical principles. This STEM-focused building set teaches gear ratios, torque, mechanical advantage, and power transfer in an engaging, visual way that makes complex concepts accessible to young learners. The durable plastic pieces securely connect and withstand repeated building and rebuilding. Perfect for developing understanding of simple machines, physics, and engineering design while encouraging creativity and problem-solving through mechanical experimentation. An excellent educational tool that bridges the gap between traditional building blocks and advanced robotics, providing a solid foundation in mechanical engineering concepts that prepares children for more complex technological learning in the future.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/gear-set.jpg",
        "subCategory": "Building Blocks"
    },
    {
        "toyId": 22,
        "toyName": "RC Monster Truck",
        "sellerName": "Off-Road Racing Co",
        "sellerEmail": "offroad@racing.com",
        "price": 54.99,
        "rating": 4.5,
        "availableQuantity": 39,
        "description": "Conquer any terrain with this powerful remote control monster truck built for extreme off-road adventures and spectacular stunts. This 1:10 scale RC monster truck features oversized knobby tires, independent suspension system, and high-torque motor that powers through grass, dirt, gravel, and indoor surfaces. The robust metal chassis and polycarbonate body withstand crashes, flips, and rough treatment while maintaining excellent performance. The 2.4GHz radio system provides precise control with a range of up to 80 meters, perfect for large outdoor spaces. Features include proportional steering and throttle control, LED headlights, and rechargeable battery with balance charger for optimal performance. The monster truck's unique design allows for impressive wheelies, jumps, and 180-degree spins that provide thrilling entertainment. This RC vehicle not only delivers exciting play but also teaches basic principles of physics, traction, and momentum through hands-on operation. The responsive controls help develop hand-eye coordination, spatial awareness, and understanding of vehicle dynamics. Perfect for outdoor adventures, racing competitions, or developing mechanical interest through interactive play. An excellent way to encourage outdoor activity while providing an introduction to RC hobby that could develop into a lifelong passion for vehicles, mechanics, and technology.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/rc-monster-truck.jpg",
        "subCategory": "Remote Control"
    },
    {
        "toyId": 23,
        "toyName": "Friendship Bracelet Maker",
        "sellerName": "Crafty Friends Studio",
        "sellerEmail": "bracelets@craftyfriends.com",
        "price": 19.99,
        "rating": 4.7,
        "availableQuantity": 94,
        "description": "Create beautiful handmade friendship bracelets with this complete bracelet-making kit that includes everything needed to master multiple weaving techniques. This comprehensive set features 36 colors of premium embroidery floss, organizing loom, clip board, and detailed instructions for 10 different bracelet patterns. Learn traditional friendship bracelet techniques including forward knots, backward knots, chevron patterns, and diamond designs that create stunning wearable art. The included bead assortment adds decorative elements to creations, while the alphabet beads allow for personalized messages and names. The portable carrying case keeps supplies organized and makes this craft perfect for sleepovers, travel, or creative sessions with friends. This arts and crafts activity develops fine motor skills, pattern recognition, color theory understanding, and patience through detailed handwork. The social aspect of creating and exchanging friendship bracelets encourages communication, generosity, and relationship building. The sense of accomplishment from completing intricate designs builds confidence and pride in handmade creations. Perfect for developing artistic skills, concentration, and the joy of giving handmade gifts that strengthen friendships and create lasting memories. All materials are high-quality and colorfast, ensuring beautiful results that can be worn and cherished for years to come.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/bracelet-kit.jpg",
        "subCategory": "Arts & Crafts"
    },
    {
        "toyId": 24,
        "toyName": "Telescope & Astronomy Set",
        "sellerName": "Starry Night Explorers",
        "sellerEmail": "stars@starrynight.com",
        "price": 89.99,
        "rating": 4.6,
        "availableQuantity": 31,
        "description": "Explore the wonders of the universe with this professional-quality 70mm aperture telescope designed for young astronomers. This complete astronomy set features a refractor telescope with 300mm focal length that provides clear, detailed views of celestial objects. Includes three eyepieces (20mm, 12mm, 6mm) that offer 15x, 25x, and 50x magnification for viewing the moon's craters, Saturn's rings, Jupiter's moons, and distant star clusters. The aluminum tripod with adjustable height provides stable viewing, while the smartphone adapter allows for astrophotography to capture and share celestial discoveries. The comprehensive guidebook includes star charts, constellation maps, and observing tips for both Northern and Southern hemispheres. This science kit introduces proper telescope operation, celestial navigation, and astronomical concepts through direct observation of the night sky. The included learning materials cover solar system planets, stars, galaxies, and basic astrophysics in an accessible format. Perfect for developing scientific curiosity, patience, and understanding of our place in the universe through hands-on exploration. An exceptional educational tool that can inspire a lifelong passion for astronomy, physics, or space science while providing family bonding opportunities through shared discovery of the cosmic wonders visible from your own backyard.",
        "pictureURL": "https://i.ibb.co/0CQ1Y2L/telescope.jpg",
        "subCategory": "Science Kits"
    }
]